# 1. За день машина едет n (км). Сколько дней нужно затратить на путь
#длиною m (км)? без конструкций и циклов
# v = int(input('введите км за день: '))
# s = int(input('введите общий путь: '))
# t = int((s - 1)/v) + 1
# print(t)

# 2. Найти необходимое кол-во парт для трех классов обучающихся.
# За одной партой может сидеть 2 человека, кол-во учеников каждого класса задается вручную.
# class_1 = int(input("колво учеников в 1 классе: "))
# class_2 = int(input("колво учеников в 2 классе: "))
# class_3 = int(input("колво учеников в 3 классе: "))
# desk = class_1 // 2 + class_2 // 2 + class_3 // 2 + class_1 % 2 + class_2 % 2 + class_3 % 2
# print(desk)