# Дан список чисел. Определите, сколько в нем встречается различных чисел.
# Input: [1, 1, 2, 0, -1, 3, 4, 4]
# list_1 = [1, 1, 2, 0, -1, 3, 4, 4, 5]
# list_1 = set(list_1)
# print(len(list_1))

# Дана последовательность из N целых чисел и число K.
# Необходимо сдвинуть всю последовательность (сдвиг - циклический) на K элементов вправо,
# K – положительное число.
# Input:   [1, 2, 3, 4, 5] k = 3
# # Output:  [3, 4, 5, 1, 2]
# k = int(input("введите сдвиг "))
# list_1 = [1, 2, 3, 4, 5]
# print(list_1[k - 1:] + list_1[:k - 1])

# 2 решение
# for i in range(k):
#     list_1.insert(0, list_1.pop())
# print(list_1)

# Напишите программу для печати всех уникальных значений в словаре.
# Input:  [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"},
#          {"VII": "S005"}, {"V":"S009"}, {"VIII":"S007"}]
# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}

# dictionary = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": "S005"},
#               {"V":"S009"}, {"VIII":"S007"}]
# new_set = set()
# for dict_i in dictionary:
#     for value in dict_i.values():
#         new_set.add(value)
# print(new_set)

# Дан массив, состоящий из целых чисел.
# Напишите программу, которая подсчитает количество элементов массива,
# больших предыдущего (элемента с предыдущим номером)
# Input: [0, -1, 5, 2, 3]

# list1 = [0, -1, 5, 2, 3]
# count = 0
# for i in range(len(list1) - 1):
#     if list1[i] < list1[i + 1]:
#         count += 1
# print(count)